Terraform plan in __terraform__
```
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.process_events_role will be created
  + resource "aws_iam_role" "process_events_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "process_events"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # aws_lambda_function.process_events will be created
  + resource "aws_lambda_function" "process_events" {
      + arn                            = (known after apply)
      + filename                       = "./lambda_package.zip"
      + function_name                  = "process_events"
      + handler                        = "index.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + source_code_hash               = "7IK7mM6s5vGtafJpe7CK6tuOsCa0SuhztLltUsqtxls="
      + source_code_size               = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + tracing_config {
          + mode = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
Plan generated in [PR Plan #12](https://github.com/dflook/terraform-github-actions-test/actions/runs/168007259)